pascal-3.2/tutorials/incompressible/icoDyMFoam/mixer2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    impellerWall
    {
        type            wall;
        nFaces          68;
        startFace       1040;
    }
    baffleWall
    {
        type            wall;
        nFaces          84;
        startFace       1108;
    }
    insideSlider
    {
        type            patch;
        nFaces          36;
        startFace       1192;
    }
    outsideSlider
    {
        type            patch;
        nFaces          36;
        startFace       1228;
    }
    defaultFaces
    {
        type            empty;
        nFaces          1152;
        startFace       1264;
    }
)

// ************************************************************************* //
